================================================================================
no consequence
================================================================================

if foo == "bar"
endif

---

(statement_list
	(if_statement
		condition: (binary_expression
			(binary_comparison
				left: (identifier)
				op: (binary_op)
				right: (string)))))

================================================================================
no consequence with elif and else
================================================================================

if foo == "bar"
elif 1 == 2
else
endif

---

(statement_list
	(if_statement
		condition: (binary_expression
			(binary_comparison
				left: (identifier)
				op: (binary_op)
				right: (string)))
		alternative: (elif_statement
			condition: (binary_expression
				(binary_comparison
					left: (number)
					op: (binary_op)
					right: (number))))
		alternative: (else_statement)))

================================================================================
with consequence
================================================================================

if foo == "bar"
	get CHUNK long
endif

---

(statement_list
	(if_statement
		condition: (binary_expression
			(binary_comparison
				left: (identifier)
				op: (binary_op)
				right: (string)))
		consequence: (statement_list
			(get_statement
				name: (identifier)
				type: (identifier)))))

================================================================================
with consequence with elif and else
================================================================================

if foo == "bar"
	get CHUNK long
elif 1 == 2
	get CHUNK short
else
	# error
endif

---

(statement_list
	(if_statement
		condition: (binary_expression
			(binary_comparison
				left: (identifier)
				op: (binary_op)
				right: (string)))
		consequence: (statement_list
			(get_statement
				name: (identifier)
				type: (identifier)))
		alternative: (elif_statement
			condition: (binary_expression
				(binary_comparison
					left: (number)
					op: (binary_op)
					right: (number)))
			consequence: (statement_list
				(get_statement
					name: (identifier)
					type: (identifier))))
		alternative: (else_statement
			consequence: (statement_list
				(comment)))))
